---
kind: other
id: Properties.T:Autodesk.Revit.DB.FormattedText
source: html/b9cf65fa-76f0-527d-d013-4e756def1823.htm
---
# FormattedText Properties

Specifies whether the .NET object represents a valid Revit entity.